{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": "glorot_uniform",
            "bias_initializer": "zeros",
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_1",
            "trainable": true,
            "batch_input_shape": [null, 7],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": "glorot_uniform",
            "bias_initializer": "zeros",
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": "glorot_uniform",
            "bias_initializer": "zeros",
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_3",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "2.13.1",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        { "name": "dense_1/kernel", "shape": [7, 64], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [64, 32], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [32], "dtype": "float32" },
        { "name": "dense_3/kernel", "shape": [32, 1], "dtype": "float32" },
        { "name": "dense_3/bias", "shape": [1], "dtype": "float32" }
      ]
    }
  ],
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v4.10.0",
  "convertedBy": null
}
